using UnityEngine;

public class _109CႦ_109D_109A႙_109BႨႦ႙ႢႡ : MonoBehaviour
{
	public _႙႙_109AႨ_109CႤ_109FႨႨႡ_109E makeRagdoll;

	public Renderer shirt;

	public void Ⴄ_109D_109A_109C_109EႥႣႣ_109C_109BႠ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႦႦႤ_109CႨ_109CႡႥ_109F_109D႙(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void MakeRagdoll(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void Ⴈ_109C_109CႡႧႠ_109FႧႠႡ_109E(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void _႙႙_109FႦႨ႙ႧႢ_109A_109D႙(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႥႦ_109AႤႦ႙႙ႦႢ_109E_109D(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void Ⴆ_109A_109D_109CႠႨ_109E႙Ⴁ_109F_109B(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void _109A_109DႣ_109E_109CႡႨႡ_109CႠႣ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void Ⴂ_109EႧႣႣ_109B_109D_109B_109A_109FႦ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႥႥ႙Ⴈ႙ႣႦႨ_109BႤ_109A(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void Ⴃ_109AႦႨႤႥ_109EႦႡႣ_109A(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void _109A_109BႢ_109FႧႧႨ_109B_109CႦ_109D(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႨႠ_109BႧႣႤႧႢႣႢႢ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႧႨႢႢႢ_109FႥႢႧႤႡ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႡႣႤႠႠႥ_109FႢ_109AႣ႙(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void Ⴆ_109D_109EႤႥ_109DႠႦႡႡႡ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void _109E_109A_109FႣႣႣ_109CႡ_109A႙Ⴇ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႢႠ_109FႠႢႨ႙Ⴅ_109CႣႨ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void Ⴀ_109BႣ_109FႠႧႠ_109B_109AႦႡ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void Ⴈ_109A_109EႢႣ_109BႠႣႥ_109D_109E(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႨႨ_109E_109E_109CႤႨႡႣ_109D_109A(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void _109AႥႣ_109FႡႢႦႦ_109A_109EႧ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void Ⴁ_109D_109CႦ႙_109D_109EႤႡႣႦ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void _109BႡႨ႙ႤႥ_109FႠႤႥ_109D(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႧႢႣ_109DႣႡႨႠ_109F_109AႣ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void _109EႠ_109CႥႤ_109DႤႠႣ_109C_109C(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void Ⴂ_109E_109AႧ_109C_109FႨႡႣႦႤ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void _109AႦႠႥ_109B_109A_109EႣ_109A႙_109D(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႦႡႧ_109B_109DႡ_109E႙ႨႨႠ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void _109C_109F_109C_109C႙Ⴄ_109F_109A_109C_109CႥ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႨႧႡႨႤႢႧ_109F႙ႧႨ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void Ⴂ_109EႨ_109F_109CႤ_109DႦ_109F_109DႠ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void Ⴈ_109B_109DႡႡ_109D_109E_109EႢႧ႙(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void Ⴃ_109DႢႣႣႠႨ_109D_109C_109DႦ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void Ⴅ_109A_109AႠ႙Ⴆ_109C_109A_109AႨႥ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void _109C႙Ⴈ_109D_109A_109C_109AႧ_109FႣႨ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႢႥႦ_109C_109EႠ_109BႦႧ႙႙(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႡႠႧႧႥ_109FႢ_109D_109AႤႨ(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void ႢႡႠႥႥ_109E_109BႡႢ_109B_109A(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void _109E_109CႧ_109EႢႨ_109A_109E႙Ⴀ_109F(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}

	public void _109A_109EႡႡႡ_109A_109AႥ_109AႧ_109A(Ⴅ_109A_109E_109E႙ႨႨ_109A_109D_109F_109C _109EႡ_109EႣႤႨ_109FႥႥႠ_109A, Vector3 _109EႤႥႠႣႢႠႦ_109D႙Ⴅ)
	{
	}
}
