using UnityEngine;

public class _109EႢႡႡႠႨႣႦႢႦ_109B : MonoBehaviour
{
	public enum Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ
	{
		Generic = 0,
		Metal = 1
	}

	public AudioClip[] genericHits;

	public AudioClip[] metalHits;

	public _109F_109A_109B႙ႠႦႠ_109BႠႠႥ sfx;

	public void ႣႠႦႤႧ_109AႨ_109E_109C_109E႙(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void _109F႙_109F႙_109EႦႤႠ_109AႨႥ(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void _109C_109EႥႤႡ_109BႣ_109BႤႧ_109A(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void ႤႣ_109E_109A_109F_109BႨႦႠ_109D_109E(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void SetSfx(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void _109DႧႣႢ_109FႣႣ_109F_109CႡႡ(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void _109B_109BႣ_109F_109CႥႥႧႣႢႢ(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void Ⴀ_109B_109EႨ_109FႦႠ_109F_109A_109DႡ(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void _႙ႢႣႦႠႠႢ_109EႥႢႤ(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void Ⴃ_109FႧ_109C_109A႙_109A_109D_109B_109BႢ(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void _109EႡႧႧ_109EႤႤႣ_109FႤႧ(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void ႨႨႣ_109AႨ_109B_109AႣႧ႙Ⴈ(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void ႤႢႡႣႣႧႢႨႨႣ_109F(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void _109BႥႡႧႨ_109C_109BႤႢႧ_109E(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}

	public void _109CႣႧႡႣ_109B႙_109C_109CႠႦ(Ⴀ_109EႤႢ_109CႤႣႠႧႣႨ Ⴄ႙ႥႥ_109B_109DႥ_109DႨ_109CႤ)
	{
	}
}
